biomejs.biome
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
exiasr.hadolint
hediet.vscode-drawio
huizhou.githd
markwhen.markwhen
medo64.render-crlf
mhutchie.git-graph
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
oderwat.indent-rainbow
pkief.material-icon-theme
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tyriar.sort-lines
