biomejs.biome
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
editorconfig.editorconfig
exiasr.hadolint
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
golang.go
hediet.vscode-drawio
huizhou.githd
markwhen.markwhen
medo64.render-crlf
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-repositories
oderwat.indent-rainbow
pkief.material-icon-theme
rust-lang.rust-analyzer
saoudrizwan.claude-dev
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tyriar.sort-lines
